[
    {
      "coverImageName": "harry_potter_philosophers_stone",
      "name": "Harry Potter and the Philosopher's Stone",
      "author": "J.K. Rowling",
      "releaseYear": "1997",
      "lengthInMinutes": 515,
      "narrator": "Stephen Fry",
      "description": "Harry Potter, an ordinary boy living with his aunt and uncle, discovers he's a wizard on his 11th birthday. Embark on his first magical adventure at Hogwarts School of Witchcraft and Wizardry, where he uncovers the mystery behind a powerful stone."
    },
    {
      "coverImageName": "harry_potter_chamber_secrets",
      "name": "Harry Potter and the Chamber of Secrets",
      "author": "J.K. Rowling",
      "releaseYear": "1998",
      "lengthInMinutes": 566,
      "narrator": "Stephen Fry",
      "description": "In his second year at Hogwarts, Harry faces new dangers as an ancient chamber is reopened, releasing a dark force that threatens the school and its students. Can Harry uncover the secret of the Chamber of Secrets before it’s too late?"
    },
    {
      "coverImageName": "harry_potter_prisoner_azkaban",
      "name": "Harry Potter and the Prisoner of Azkaban",
      "author": "J.K. Rowling",
      "releaseYear": "1999",
      "lengthInMinutes": 732,
      "narrator": "Stephen Fry",
      "description": "Harry returns for his third year at Hogwarts to find out that a dangerous prisoner has escaped from Azkaban. With new allies and old enemies, Harry must confront his past and uncover the truth about his mysterious connection to the escaped convict."
    },
    {
      "coverImageName": "harry_potter_goblet_fire",
      "name": "Harry Potter and the Goblet of Fire",
      "author": "J.K. Rowling",
      "releaseYear": "2000",
      "lengthInMinutes": 1079,
      "narrator": "Stephen Fry",
      "description": "In his fourth year at Hogwarts, Harry unexpectedly becomes a contestant in the dangerous Triwizard Tournament. As the stakes rise and dark forces gather, Harry finds himself at the center of an ominous plot that threatens the wizarding world."
    },
    {
      "coverImageName": "harry_potter_order_phoenix",
      "name": "Harry Potter and the Order of the Phoenix",
      "author": "J.K. Rowling",
      "releaseYear": "2003",
      "lengthInMinutes": 1260,
      "narrator": "Stephen Fry",
      "description": "Harry's fifth year at Hogwarts is filled with tension as the wizarding world faces denial about the return of Lord Voldemort. As Harry forms a secret group to defend against the rising threat, he learns more about his own destiny and the power of unity."
    },
    {
      "coverImageName": "harry_potter_half_blood_prince",
      "name": "Harry Potter and the Half-Blood Prince",
      "author": "J.K. Rowling",
      "releaseYear": "2005",
      "lengthInMinutes": 1086,
      "narrator": "Stephen Fry",
      "description": "As dark forces tighten their grip, Harry delves into the mysterious past of Lord Voldemort with the help of an old potions book. In this penultimate book, friendships are tested, secrets are revealed, and Harry faces a heartbreaking loss."
    },
    {
      "coverImageName": "harry_potter_deathly_hallows",
      "name": "Harry Potter and the Deathly Hallows",
      "author": "J.K. Rowling",
      "releaseYear": "2007",
      "lengthInMinutes": 1243,
      "narrator": "Stephen Fry",
      "description": "In the epic conclusion to the series, Harry, Ron, and Hermione embark on a perilous journey to find and destroy Voldemort’s Horcruxes. With the final battle looming, Harry must make the ultimate sacrifice to save the wizarding world."
    },
    {
      "coverImageName": "harry_potter_cursed_child",
      "name": "Harry Potter and the Cursed Child",
      "author": "J.K. Rowling, Jack Thorne, John Tiffany",
      "releaseYear": "2016",
      "lengthInMinutes": 360,
      "narrator": "Imogen Heap",
      "description": "Set 19 years after the events of the original series, Harry’s son Albus struggles with his family legacy. As dark forces re-emerge, father and son must confront the weight of their past in this new magical adventure."
    }
]

